src/cf/Catalogs/инт_ПодписчикиKafka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПодписчикиKafka</Name>
			<Comment>Подписчики для отправки в Apache Kafka</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эндпоинт</Name>
					<Comment>Kafka брокер (bootstrap servers)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТопика</Name>
					<Comment>Имя топика в Kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетнаяОбработка</Name>
					<Comment>Сообщения будут отправлены пакетом в конце обработки потока</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСжатия</Name>
					<Comment>Тип сжатия сообщений (compression.codec для librdkafka)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыСжатияKafka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСжатияDLQ</Name>
					<Comment>Тип сжатия сообщений DLQ (compression.codec для librdkafka)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыСжатияKafka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяDLQТопика</Name>
					<Comment>Топик для "мёртвых" сообщений (Dead Letter Queue)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКакКонсьюмер</Name>
					<Comment>Признак использования подписчика в режиме консьюмера (управляет видимостью DLQ и оффсетов)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/инт_ПодписчикиKafka/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_ПодписчикиKafka.ФормаЭлемента
// Форма подписчика Kafka с управлением топиками, DLQ и оффсетами
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьВсеСтатусы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализация реквизитов формы
	СтатусТопика = 0; // 0 - неизвестен, 1 - существует, 2 - не существует, 3 - ошибка
	СтатусDLQТопика = 0;
	
	КоличествоПартиций = 1;
	ФакторРепликации = 1;
	КоличествоПартицийDLQ = 1;
	ФакторРепликацииDLQ = 1;
	
	ОбновитьСтатусDrainНаСервере();
	ОбновитьВидимостьЭлементовФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПроверитьВсеСтатусы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭндпоинтПриИзменении(Элемент)
	СтатусТопика = 0;
	СтатусDLQТопика = 0;
	ОбновитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИмяТопикаПриИзменении(Элемент)
	СтатусТопика = 0;
	ОбновитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИмяDLQТопикаПриИзменении(Элемент)
	СтатусDLQТопика = 0;
	ОбновитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакКонсьюмерПриИзменении(Элемент)
	ОбновитьВидимостьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ════════════════════════════════════════════════════
// Drain консьюмера
// ════════════════════════════════════════════════════

&НаКлиенте
Процедура DrainКонсьюмер(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Сначала запишите подписчика.");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("DrainКонсьюмерЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,
		СтрШаблон("Перевести консьюмер '%1' в режим drain?
			|
			|Все консьюмеры, использующие этот топик, будут перезапущены без него.",
			Объект.Наименование),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура DrainКонсьюмерЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	DrainКонсьюмерНаСервере();
	ПоказатьПредупреждение(, "Консьюмер переведён в режим drain.");
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьКонсьюмер(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ВосстановитьКонсьюмерНаСервере();
	ПоказатьПредупреждение(, "Консьюмер восстановлен. При следующем тике менеджера подписка будет включена.");
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

// ══════════════════════════════════════════════════// Тест подключения
// ════════════════════════════════════════════════════

&НаКлиенте
Процедура ТестПодключения(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) Тогда
		ПоказатьПредупреждение(, "Не указан эндпоинт (брокер Kafka)!");
		Возврат;
	КонецЕсли;
	
	Результат = ВыполнитьТестПодключенияНаСервере();
	
	Если Результат.Успех Тогда
		ТекстСообщения = СтрШаблон("Подключение успешно!
			|
			|Информация о кластере:
			|  Брокеров: %1
			|  Топиков: %2",
			Результат.КоличествоБрокеров,
			Результат.КоличествоТопиков);
		ПоказатьПредупреждение(, ТекстСообщения);
		ПроверитьВсеСтатусы();
	Иначе
		ПоказатьПредупреждение(, "Ошибка подключения: " + Результат.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

// ════════════════════════════════════════════════════
// Обновить информацию
// ════════════════════════════════════════════════════

&НаКлиенте
Процедура ОбновитьИнформацию(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) Тогда
		ПоказатьПредупреждение(, "Не указан эндпоинт!");
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусDrainНаСервере();
	ПроверитьВсеСтатусы();
	
КонецПроцедуры

// ════════════════════════════════════════════════════
// Основной топик
// ════════════════════════════════════════════════════

&НаКлиенте
Процедура ПроверитьТопик(Команда)
	ПроверитьСтатусТопика();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТопик(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) Тогда
		ПоказатьПредупреждение(, "Не указан эндпоинт!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ИмяТопика) Тогда
		ПоказатьПредупреждение(, "Не указано имя топика!");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьТопикЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,
		СтрШаблон("Создать топик '%1'?
			|
			|  Партиций: %2
			|  Фактор репликации: %3",
			Объект.ИмяТопика, КоличествоПартиций, ФакторРепликации),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТопикЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСоздания = СоздатьТопикНаСервере(Объект.ИмяТопика, КоличествоПартиций, ФакторРепликации);
	
	Если РезультатСоздания.Успех Тогда
		ПоказатьПредупреждение(, СтрШаблон("Топик '%1' успешно создан!", Объект.ИмяТопика));
		ПроверитьСтатусТопика();
	Иначе
		ПоказатьПредупреждение(, "Ошибка создания топика: " + РезультатСоздания.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если НЕ ЕстьИзмененныеНастройки(НастройкиТопика) Тогда
		ПоказатьПредупреждение(, "Нет изменённых настроек для сохранения.");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,
		"Сохранить изменённые настройки топика в Kafka?",
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = СохранитьНастройкиНаСервере(Объект.ИмяТопика, НастройкиТопика);
	
	Если РезультатСохранения.Успех Тогда
		ПоказатьПредупреждение(, СтрШаблон("Настройки топика '%1' сохранены!", Объект.ИмяТопика));
		ПроверитьСтатусТопика();
	Иначе
		ПоказатьПредупреждение(, "Ошибка сохранения настроек: " + РезультатСохранения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

// ════════════════════════════════════════════════════
// DLQ-топик
// ════════════════════════════════════════════════════

&НаКлиенте
Процедура ПроверитьDLQ(Команда)
	ПроверитьСтатусDLQ();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьDLQ(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) Тогда
		ПоказатьПредупреждение(, "Не указан эндпоинт!");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ИмяDLQТопика) Тогда
		ПоказатьПредупреждение(, "Не указано имя DLQ топика!");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьDLQЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,
		СтрШаблон("Создать DLQ топик '%1'?
			|
			|  Партиций: %2
			|  Фактор репликации: %3",
			Объект.ИмяDLQТопика, КоличествоПартицийDLQ, ФакторРепликацииDLQ),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьDLQЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСоздания = СоздатьТопикНаСервере(Объект.ИмяDLQТопика, КоличествоПартицийDLQ, ФакторРепликацииDLQ);
	
	Если РезультатСоздания.Успех Тогда
		ПоказатьПредупреждение(, СтрШаблон("DLQ топик '%1' успешно создан!", Объект.ИмяDLQТопика));
		ПроверитьСтатусDLQ();
	Иначе
		ПоказатьПредупреждение(, "Ошибка создания DLQ топика: " + РезультатСоздания.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиDLQ(Команда)
	
	Если НЕ ЕстьИзмененныеНастройки(НастройкиDLQ) Тогда
		ПоказатьПредупреждение(, "Нет изменённых настроек DLQ для сохранения.");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьНастройкиDLQЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,
		"Сохранить изменённые настройки DLQ топика в Kafka?",
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиDLQЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РезультатСохранения = СохранитьНастройкиНаСервере(Объект.ИмяDLQТопика, НастройкиDLQ);
	
	Если РезультатСохранения.Успех Тогда
		ПоказатьПредупреждение(, СтрШаблон("Настройки DLQ '%1' сохранены!", Объект.ИмяDLQТопика));
		ПроверитьСтатусDLQ();
	Иначе
		ПоказатьПредупреждение(, "Ошибка сохранения настроек DLQ: " + РезультатСохранения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

// ════════════════════════════════════════════════════
// Отправить сообщение
// ════════════════════════════════════════════════════

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) ИЛИ НЕ ЗначениеЗаполнено(Объект.ИмяТопика) Тогда
		ПоказатьПредупреждение(, "Для отправки сообщения необходимо указать эндпоинт и имя топика");
		Возврат;
	КонецЕсли;
	
	Если СтатусТопика <> 1 Тогда
		ПоказатьПредупреждение(, "Топик не существует. Сначала создайте топик.");
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("Эндпоинт, ИмяТопика, ТипСжатия",
		Объект.Эндпоинт, Объект.ИмяТопика, Объект.ТипСжатия);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьСообщениеЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	ПоказатьВводСтроки(ОписаниеОповещения, "", "Введите текст сообщения для отправки в топик:", 0, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеЗавершение(ТекстСообщения, ДополнительныеПараметры) Экспорт
	
	Если ТекстСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		ПоказатьПредупреждение(, "Текст сообщения не может быть пустым");
		Возврат;
	КонецЕсли;
	
	РезультатОтправки = ОтправитьСообщениеНаСервере(
		ДополнительныеПараметры.Эндпоинт,
		ДополнительныеПараметры.ИмяТопика,
		ТекстСообщения, ДополнительныеПараметры.ТипСжатия);
	
	Если РезультатОтправки.Успех Тогда
		ПоказатьПредупреждение(, СтрШаблон("Сообщение успешно отправлено в топик '%1'",
			ДополнительныеПараметры.ИмяТопика));
	Иначе
		ПоказатьПредупреждение(, "Ошибка отправки сообщения: " + РезультатОтправки.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

// ════════════════════════════════════════════════════
// Консьюмеры и оффсеты
// ════════════════════════════════════════════════════

&НаКлиенте
Процедура ЗагрузитьОффсеты(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) Тогда
		ПоказатьПредупреждение(, "Не указан эндпоинт!");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.ИмяТопика) Тогда
		ПоказатьПредупреждение(, "Не указано имя топика!");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОффсетыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НаНачало(Команда)
	
	Для Каждого СтрокаОффсета Из Оффсеты Цикл
		СтрокаОффсета.НовыйОффсет = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НаКонец(Команда)
	
	Для Каждого СтрокаОффсета Из Оффсеты Цикл
		СтрокаОффсета.НовыйОффсет = СтрокаОффсета.HighWatermark;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОффсеты(Команда)
	
	Если Оффсеты.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Нет данных об оффсетах. Сначала загрузите оффсеты.");
		Возврат;
	КонецЕсли;
	
	ЕстьИзменения = Ложь;
	Для Каждого СтрокаОффсета Из Оффсеты Цикл
		Если СтрокаОффсета.НовыйОффсет <> СтрокаОффсета.ТекущийОффсет Тогда
			ЕстьИзменения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьИзменения Тогда
		ПоказатьПредупреждение(, "Нет изменений в оффсетах.");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрименитьОффсетыЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,
		СтрШаблон("Применить новые оффсеты в топике '%1'?
			|
			|Внимание: консьюмер должен быть остановлен!",
			Объект.ИмяТопика),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьОффсетыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПрименения = ПрименитьОффсетыНаСервере();
	
	Если РезультатПрименения.Успех Тогда
		ПоказатьПредупреждение(, СтрШаблон("Оффсеты успешно применены! Изменено партиций: %1",
			РезультатПрименения.Изменено));
		ЗагрузитьОффсетыНаСервере();
	Иначе
		ПоказатьПредупреждение(, "Ошибка применения оффсетов: " + РезультатПрименения.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблиц

&НаКлиенте
Процедура НастройкиТопикаЗначениеНастройкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НастройкиТопика.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Изменено = (ТекущаяСтрока.ЗначениеНастройки <> ТекущаяСтрока.ИсходноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиТопикаКлючНастройкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НастройкиТопика.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущаяСтрока.ИсходноеЗначение) Тогда
		ТекущаяСтрока.Изменено = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиТопикаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.НастройкиТопика.ТекущиеДанные;
		Если ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.Изменено = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиDLQЗначениеНастройкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НастройкиDLQ.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Изменено = (ТекущаяСтрока.ЗначениеНастройки <> ТекущаяСтрока.ИсходноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ════════════════════════════════════════════════════
// Серверные вызовы
// ════════════════════════════════════════════════════

&НаСервере
Функция ВыполнитьТестПодключенияНаСервере()
	
	Брокеры = Объект.Эндпоинт.АдресРесурса;
	Результат = инт_РаботаСКафка.ПроверитьДоступностьБрокера(Брокеры, , Объект.Эндпоинт);
	
	ВозвращаемыйРезультат = Новый Структура("Успех, ОписаниеОшибки, КоличествоБрокеров, КоличествоТопиков",
		Результат.Успех, Результат.ОписаниеОшибки, 0, 0);
	
	Если Результат.Успех И Результат.ИнформацияОКластере <> Неопределено Тогда
		КолБрокеров = Результат.ИнформацияОКластере.Получить("brokers_count");
		Если КолБрокеров <> Неопределено Тогда
			ВозвращаемыйРезультат.КоличествоБрокеров = Число(КолБрокеров);
		КонецЕсли;
		
		КолТопиков = Результат.ИнформацияОКластере.Получить("topics_count");
		Если КолТопиков <> Неопределено Тогда
			ВозвращаемыйРезультат.КоличествоТопиков = Число(КолТопиков);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозвращаемыйРезультат;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусDrainНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОстановленныеПодписки = инт_МенеджерВходящихПотоков.ПолучитьОстановленныеПодписки();
		КонсьюмерВРежимеDrain = Ложь;
		Для Каждого Элемент Из ОстановленныеПодписки Цикл
			Если Элемент.Подписка = Объект.Ссылка Тогда
				КонсьюмерВРежимеDrain = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		КонсьюмерВРежимеDrain = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура DrainКонсьюмерНаСервере()
	
	инт_МенеджерВходящихПотоков.DrainПодписку(Объект.Ссылка);
	КонсьюмерВРежимеDrain = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьКонсьюмерНаСервере()
	
	инт_МенеджерВходящихПотоков.ВосстановитьПодписку(Объект.Ссылка);
	КонсьюмерВРежимеDrain = Ложь;
	
КонецПроцедуры

&НаСервере
Функция СоздатьТопикНаСервере(Знач ИмяТопикаДляСоздания, Знач Партиций, Знач РепликаФактор)
	
	Брокеры = Объект.Эндпоинт.АдресРесурса;
	Возврат инт_РаботаСКафка.СоздатьТопик(Брокеры, ИмяТопикаДляСоздания, Партиций, РепликаФактор, Объект.Эндпоинт);
	
КонецФункции

&НаСервере
Функция СохранитьНастройкиНаСервере(Знач ИмяТопикаДляНастроек, Знач ТаблицаНастроек)
	
	Брокеры = Объект.Эндпоинт.АдресРесурса;
	
	ИзмененныеНастройки = Новый Соответствие;
	
	Для Каждого СтрокаНастройки Из ТаблицаНастроек Цикл
		Если СтрокаНастройки.Изменено И ЗначениеЗаполнено(СтрокаНастройки.КлючНастройки) Тогда
			ИзмененныеНастройки.Вставить(СтрокаНастройки.КлючНастройки, СтрокаНастройки.ЗначениеНастройки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат инт_РаботаСКафка.УстановитьНастройкиТопика(Брокеры, ИмяТопикаДляНастроек, ИзмененныеНастройки, Объект.Эндпоинт);
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьСообщениеНаСервере(Эндпоинт, ИмяТопика, ТекстСообщения, ТипСжатия)
	
	Результат = Новый Структура("Успех, ОписаниеОшибки", Ложь, "");
	
	Попытка
		Брокеры = Эндпоинт.АдресРесурса;
		инт_РаботаСКафка.ОтправитьСообщение(ТекстСообщения, Брокеры, ИмяТопика, ,,,ТипСжатия, Эндпоинт);
		Результат.Успех = Истина;
	Исключение
		Результат.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// ════════════════════════════════════════════════════
// Проверка статусов
// ════════════════════════════════════════════════════

&НаКлиенте
Процедура ПроверитьВсеСтатусы()
	ПроверитьСтатусТопика();
	Если Объект.ИспользоватьКакКонсьюмер Тогда
		ПроверитьСтатусDLQ();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтатусТопика()
	
	Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) ИЛИ НЕ ЗначениеЗаполнено(Объект.ИмяТопика) Тогда
		СтатусТопика = 0;
		ОбновитьВидимостьЭлементовФормы();
		Возврат;
	КонецЕсли;
	
	ПроверитьСтатусТопикаНаСервере();
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтатусТопикаНаСервере()
	
	Брокеры = Объект.Эндпоинт.АдресРесурса;
	Результат = инт_РаботаСКафка.ТопикСуществует(Брокеры, Объект.ИмяТопика, Объект.Эндпоинт);
	
	Если НЕ ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
		СтатусТопика = 3;
		ИнформацияОТопике = "Ошибка: " + Результат.ОписаниеОшибки;
	ИначеЕсли Результат.Существует Тогда
		СтатусТопика = 1;
		
		ДанныеТопика = Результат.Метаданные;
		Если ДанныеТопика <> Неопределено Тогда
			КолПартиций = ДанныеТопика.Получить("partitions_count");
			Если КолПартиций = Неопределено Тогда
				КолПартиций = "?";
			КонецЕсли;
			ИнформацияОТопике = СтрШаблон("Топик существует. Партиций: %1", КолПартиций);
		Иначе
			ИнформацияОТопике = "Топик существует";
		КонецЕсли;
		
		// Загружаем настройки топика
		РезультатНастроек = инт_РаботаСКафка.ПолучитьНастройкиТопика(Брокеры, Объект.ИмяТопика, Объект.Эндпоинт);
		Если РезультатНастроек.Успех Тогда
			ЗаполнитьНастройкиВТаблицу(НастройкиТопика, РезультатНастроек.Настройки);
		КонецЕсли;
		
		// Загружаем информацию о партициях
		ЗагрузитьПартицииНаСервере();
	Иначе
		СтатусТопика = 2;
		ИнформацияОТопике = "Топик не найден в Kafka";
	КонецЕсли;
	
	ОбновитьВидимостьЭлементовФормыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтатусDLQ()
	
	Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) ИЛИ ПустаяСтрока(Объект.ИмяDLQТопика) Тогда
		СтатусDLQТопика = 0;
		ОбновитьВидимостьЭлементовФормы();
		Возврат;
	КонецЕсли;
	
	ПроверитьСтатусDLQНаСервере();
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтатусDLQНаСервере()
	
	Брокеры = Объект.Эндпоинт.АдресРесурса;
	Результат = инт_РаботаСКафка.ТопикСуществует(Брокеры, Объект.ИмяDLQТопика, Объект.Эндпоинт);
	
	Если НЕ ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
		СтатусDLQТопика = 3;
		ИнформацияОDLQТопике = "Ошибка: " + Результат.ОписаниеОшибки;
	ИначеЕсли Результат.Существует Тогда
		СтатусDLQТопика = 1;
		
		ДанныеТопика = Результат.Метаданные;
		Если ДанныеТопика <> Неопределено Тогда
			КолПартиций = ДанныеТопика.Получить("partitions_count");
			ИнформацияОDLQТопике = СтрШаблон("DLQ существует. Партиций: %1", ?(КолПартиций = Неопределено, "?", КолПартиций));
		Иначе
			ИнформацияОDLQТопике = "DLQ топик существует";
		КонецЕсли;
		
		// Настройки DLQ
		РезультатНастроек = инт_РаботаСКафка.ПолучитьНастройкиТопика(Брокеры, Объект.ИмяDLQТопика, Объект.Эндпоинт);
		Если РезультатНастроек.Успех Тогда
			ЗаполнитьНастройкиВТаблицу(НастройкиDLQ, РезультатНастроек.Настройки);
		КонецЕсли;
	Иначе
		СтатусDLQТопика = 2;
		ИнформацияОDLQТопике = "DLQ топик не найден в Kafka";
	КонецЕсли;
	
	ОбновитьВидимостьЭлементовФормыНаСервере();
	
КонецПроцедуры

// ════════════════════════════════════════════════════
// Партиции
// ════════════════════════════════════════════════════

&НаСервере
Процедура ЗагрузитьПартицииНаСервере()
	
	Партиции.Очистить();
	
	Брокеры = Объект.Эндпоинт.АдресРесурса;
	
	Попытка
		РезультатПартиций = инт_РаботаСКафка.ПолучитьИнформациюОПартициях(Брокеры, Объект.ИмяТопика, Объект.Эндпоинт);
		
		Если РезультатПартиций.Успех Тогда
			Для Каждого ДанныеПартиции Из РезультатПартиций.Партиции Цикл
				НоваяСтрока = Партиции.Добавить();
				НоваяСтрока.НомерПартиции = ДанныеПартиции.НомерПартиции;
				НоваяСтрока.Лидер = ДанныеПартиции.Лидер;
				НоваяСтрока.HighWatermark = ДанныеПартиции.HighWatermark;
				НоваяСтрока.LowWatermark = ДанныеПартиции.LowWatermark;
				НоваяСтрока.КоличествоСообщений = ДанныеПартиции.HighWatermark - ДанныеПартиции.LowWatermark;
			КонецЦикла;
		КонецЕсли;
	Исключение
		// Игнорируем ошибки загрузки партиций — они вспомогательны
	КонецПопытки;
	
КонецПроцедуры

// ════════════════════════════════════════════════════
// Оффсеты
// ════════════════════════════════════════════════════

&НаСервере
Процедура ЗагрузитьОффсетыНаСервере()
	
	Оффсеты.Очистить();
	
	Брокеры = Объект.Эндпоинт.АдресРесурса;
	
	ГруппаКонсьюмеров = инт_КонсьюмерОчередейСлужебный.СформироватьИдентификаторГруппы("consumer");
	
	Попытка
		// ПолучитьОффсетыКонсьюмера использует Admin API ПолучитьОтставаниеКонсьюмера —
		// возвращает committed_offset, high_watermark, lag в одном вызове
		РезультатОффсетов = инт_РаботаСКафка.ПолучитьОффсетыКонсьюмера(
			Брокеры, ГруппаКонсьюмеров, Объект.ИмяТопика, Объект.Эндпоинт);
	Исключение
		Сообщить("Ошибка загрузки оффсетов: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	Если НЕ РезультатОффсетов.Успех Тогда
		Сообщить("Ошибка загрузки оффсетов: " + РезультатОффсетов.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеОффсета Из РезультатОффсетов.Оффсеты Цикл
		НоваяСтрока = Оффсеты.Добавить();
		НоваяСтрока.НомерПартиции = ДанныеОффсета.НомерПартиции;
		НоваяСтрока.ТекущийОффсет = ДанныеОффсета.ТекущийОффсет;
		НоваяСтрока.НовыйОффсет = ДанныеОффсета.ТекущийОффсет;
		НоваяСтрока.HighWatermark = ДанныеОффсета.HighWatermark;
		НоваяСтрока.Лаг = ДанныеОффсета.Лаг;
	КонецЦикла;
	
	Оффсеты.Сортировать("НомерПартиции");
	
КонецПроцедуры

&НаСервере
Функция ПрименитьОффсетыНаСервере()
	
	Результат = Новый Структура("Успех, ОписаниеОшибки, Изменено", Ложь, "", 0);
	
	Брокеры = Объект.Эндпоинт.АдресРесурса;
	ГруппаКонсьюмеров = инт_КонсьюмерОчередейСлужебный.СформироватьИдентификаторГруппы("consumer");
	КоличествоИзменено = 0;
	
	Для Каждого СтрокаОффсета Из Оффсеты Цикл
		Если СтрокаОффсета.НовыйОффсет = СтрокаОффсета.ТекущийОффсет Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатУстановки = инт_РаботаСКафка.УстановитьОффсетКонсьюмера(
			Брокеры,
			ГруппаКонсьюмеров,
			Объект.ИмяТопика,
			СтрокаОффсета.НомерПартиции,
			СтрокаОффсета.НовыйОффсет,
			Объект.Эндпоинт);
		
		Если НЕ РезультатУстановки.Успех Тогда
			Результат.ОписаниеОшибки = СтрШаблон("Партиция %1: %2",
				СтрокаОффсета.НомерПартиции, РезультатУстановки.ОписаниеОшибки);
			Возврат Результат;
		КонецЕсли;
		
		КоличествоИзменено = КоличествоИзменено + 1;
	КонецЦикла;
	
	Результат.Успех = Истина;
	Результат.Изменено = КоличествоИзменено;
	Возврат Результат;
	
КонецФункции

// ════════════════════════════════════════════════════
// Настройки
// ════════════════════════════════════════════════════

&НаСервере
Процедура ЗаполнитьНастройкиВТаблицу(ТаблицаНастроек, Настройки)
	
	ТаблицаНастроек.Очистить();
	
	Для Каждого КлючЗначение Из Настройки Цикл
		НоваяСтрока = ТаблицаНастроек.Добавить();
		НоваяСтрока.КлючНастройки = КлючЗначение.Ключ;
		НоваяСтрока.ЗначениеНастройки = Строка(?(КлючЗначение.Значение = Неопределено, "", КлючЗначение.Значение));
		НоваяСтрока.ИсходноеЗначение = НоваяСтрока.ЗначениеНастройки;
		НоваяСтрока.Изменено = Ложь;
	КонецЦикла;
	
	ТаблицаНастроек.Сортировать("КлючНастройки");
	
КонецПроцедуры

// ════════════════════════════════════════════════════
// Видимость элементов
// ════════════════════════════════════════════════════

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовФормы()
	
	// Консьюмерные группы
	Элементы.ГруппаDLQ.Видимость = Объект.ИспользоватьКакКонсьюмер;
	Элементы.ГруппаОффсеты.Видимость = Объект.ИспользоватьКакКонсьюмер;
	Элементы.ГруппаDrain.Видимость = Объект.ИспользоватьКакКонсьюмер;
	
	// Drain
	Если Объект.ИспользоватьКакКонсьюмер Тогда
		Элементы.ФормаDrainКонсьюмер.Видимость = НЕ КонсьюмерВРежимеDrain;
		Элементы.ФормаВосстановитьКонсьюмер.Видимость = КонсьюмерВРежимеDrain;
		
		Если КонсьюмерВРежимеDrain Тогда
			Элементы.КартинкаСтатусDrain.Картинка = БиблиотекаКартинок.ОформлениеЗнакВосклицательныйЗнак;
			Элементы.ДекорацияСтатусDrain.Заголовок = "Консьюмер остановлен (drained)";
		Иначе
			Элементы.КартинкаСтатусDrain.Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
			Элементы.ДекорацияСтатусDrain.Заголовок = "Консьюмер активен";
		КонецЕсли;
	КонецЕсли;
	
	// Основной топик
	Элементы.ГруппаТопикСоздатьТопик.Видимость = (СтатусТопика = 2);
	Элементы.ГруппаТопикОтправитьСообщение.Видимость = (СтатусТопика = 1);
	Элементы.ГруппаСозданиеТопика.Видимость = (СтатусТопика = 2);
	Элементы.ГруппаПараметрыТопика.Видимость = (СтатусТопика = 1);
	Элементы.ГруппаПартиции.Видимость = (СтатусТопика = 1);
	
	// DLQ
	Если Объект.ИспользоватьКакКонсьюмер Тогда
		Элементы.ГруппаDLQСоздатьDLQ.Видимость = (СтатусDLQТопика = 2);
		Элементы.ГруппаСозданиеDLQ.Видимость = (СтатусDLQТопика = 2);
		Элементы.ГруппаПараметрыDLQ.Видимость = (СтатусDLQТопика = 1);
	КонецЕсли;
	
	// Индикаторы статуса
	ОбновитьИндикаторСтатуса(СтатусТопика, ИнформацияОТопике,
		"КартинкаСтатусТопика", "ДекорацияСтатусТопика");
	ОбновитьИндикаторСтатуса(СтатусDLQТопика, ИнформацияОDLQТопике,
		"КартинкаСтатусDLQ", "ДекорацияСтатусDLQ");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементовФормыНаСервере()
	
	// Консьюмерные группы
	Элементы.ГруппаDLQ.Видимость = Объект.ИспользоватьКакКонсьюмер;
	Элементы.ГруппаОффсеты.Видимость = Объект.ИспользоватьКакКонсьюмер;
	Элементы.ГруппаDrain.Видимость = Объект.ИспользоватьКакКонсьюмер;
	
	// Drain
	Если Объект.ИспользоватьКакКонсьюмер Тогда
		Элементы.ФормаDrainКонсьюмер.Видимость = НЕ КонсьюмерВРежимеDrain;
		Элементы.ФормаВосстановитьКонсьюмер.Видимость = КонсьюмерВРежимеDrain;
		
		Если КонсьюмерВРежимеDrain Тогда
			Элементы.КартинкаСтатусDrain.Картинка = БиблиотекаКартинок.ОформлениеЗнакВосклицательныйЗнак;
			Элементы.ДекорацияСтатусDrain.Заголовок = "Консьюмер остановлен (drained)";
		Иначе
			Элементы.КартинкаСтатусDrain.Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
			Элементы.ДекорацияСтатусDrain.Заголовок = "Консьюмер активен";
		КонецЕсли;
	КонецЕсли;
	
	// Основной топик
	Элементы.ГруппаТопикСоздатьТопик.Видимость = (СтатусТопика = 2);
	Элементы.ГруппаТопикОтправитьСообщение.Видимость = (СтатусТопика = 1);
	Элементы.ГруппаСозданиеТопика.Видимость = (СтатусТопика = 2);
	Элементы.ГруппаПараметрыТопика.Видимость = (СтатусТопика = 1);
	Элементы.ГруппаПартиции.Видимость = (СтатусТопика = 1);
	
	// DLQ
	Если Объект.ИспользоватьКакКонсьюмер Тогда
		Элементы.ГруппаDLQСоздатьDLQ.Видимость = (СтатусDLQТопика = 2);
		Элементы.ГруппаСозданиеDLQ.Видимость = (СтатусDLQТопика = 2);
		Элементы.ГруппаПараметрыDLQ.Видимость = (СтатусDLQТопика = 1);
	КонецЕсли;
	
	// Индикаторы статуса (серверная версия)
	ОбновитьИндикаторСтатусаНаСервере(СтатусТопика, ИнформацияОТопике,
		"КартинкаСтатусТопика", "ДекорацияСтатусТопика");
	ОбновитьИндикаторСтатусаНаСервере(СтатусDLQТопика, ИнформацияОDLQТопике,
		"КартинкаСтатусDLQ", "ДекорацияСтатусDLQ");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИндикаторСтатуса(Знач Статус, Знач Информация, Знач ИмяКартинки, Знач ИмяДекорации)
	
	Если Статус = 0 Тогда
		Элементы[ИмяКартинки].Картинка = БиблиотекаКартинок.ОформлениеКругПустой;
		Элементы[ИмяДекорации].Заголовок = "Не проверено";
	ИначеЕсли Статус = 1 Тогда
		Элементы[ИмяКартинки].Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
		Элементы[ИмяДекорации].Заголовок = Информация;
	ИначеЕсли Статус = 2 Тогда
		Элементы[ИмяКартинки].Картинка = БиблиотекаКартинок.ОформлениеЗнакВосклицательныйЗнак;
		Элементы[ИмяДекорации].Заголовок = Информация;
	ИначеЕсли Статус = 3 Тогда
		Элементы[ИмяКартинки].Картинка = БиблиотекаКартинок.ОформлениеЗнакКрест;
		Элементы[ИмяДекорации].Заголовок = Информация;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИндикаторСтатусаНаСервере(Знач Статус, Знач Информация, Знач ИмяКартинки, Знач ИмяДекорации)
	
	Если Статус = 0 Тогда
		Элементы[ИмяКартинки].Картинка = БиблиотекаКартинок.ОформлениеКругПустой;
		Элементы[ИмяДекорации].Заголовок = "Не проверено";
	ИначеЕсли Статус = 1 Тогда
		Элементы[ИмяКартинки].Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
		Элементы[ИмяДекорации].Заголовок = Информация;
	ИначеЕсли Статус = 2 Тогда
		Элементы[ИмяКартинки].Картинка = БиблиотекаКартинок.ОформлениеЗнакВосклицательныйЗнак;
		Элементы[ИмяДекорации].Заголовок = Информация;
	ИначеЕсли Статус = 3 Тогда
		Элементы[ИмяКартинки].Картинка = БиблиотекаКартинок.ОформлениеЗнакКрест;
		Элементы[ИмяДекорации].Заголовок = Информация;
	КонецЕсли;
	
КонецПроцедуры

// ════════════════════════════════════════════════════
// Вспомогательные
// ════════════════════════════════════════════════════

&НаКлиенте
Функция ЕстьИзмененныеНастройки(ТаблицаНастроек)
	
	Для Каждого СтрокаНастройки Из ТаблицаНастроек Цикл
		Если СтрокаНастройки.Изменено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
